{
  "questions": [
    { "id": "year-of-birth", "number": 1, "text": "В каком году вы родились?" },
    { "id": "city", "number": 2, "text": "В каком городе вы живёте?" },
    { "id": "education", "number": 3, "text": "Вуз, факультет, специальность, кафедра:" },
    { "id": "education-year", "number": 4, "text": "Год окончания вуза" },
    { "id": "en-skill", "number": 5, 
      "text": "Уровень владения английским языком",
      "name": "en_skill",
      "radio_buttons": [
        { "value": "beginner", "text": "Начальный"},
        { "value": "experienced", "text": "Средний"},
        { "value": "fluent", "text": "Свободное владение"}
      ]
    },
    { "id": "expectations", "number": 6, "text": "Чего Вы ждете от участия в Школе?" },
    { "id": "where-found-us", "number": 7, "text": "Откуда Вы о нас узнали?" },
    { "id": "how-much-time", "number": 8, "text": "Сколько времени вы были бы готовы уделять стажировке или работе в Яндексе?" },
    { "id": "expirience", "number": 9, "text": "Расскажите о вашем опыте разработки. Нам будет интересно всё — как серьезный интерфейс, так и просто домашняя страничка." },
    { "id": "about-past-work", "number": 10, "text": "Если вы где-нибудь работали, расскажите, какие у вас были должностные обязанности и был ли опыт работы в команде." },
    { "id": "which-software", "number": 11, "text": "Перечислите, какими программными продуктами вы пользуетесь в своей работе — от редактора до специализированных утилит (Intellij Idea, Node.js, Uglify.js, GNU Make). Для каждого инструмента укажите, какие задачи вы с помощью него решаете и почему выбрали именно его." },
    { "id": "command-line", "number": 12, "text": "Пользуетесь ли вы командной строкой? Какими командами вы пользуетесь и какие задачи вы решаете с их помощью? С какими программами вы преимущественно или полностью взаимодействуете через интерфейс командной строки?" },
    { "id": "factorion", "number": 13, "text": "Напишите на JavaScript функцию, которая выводит список всех чисел, которые равны сумме факториалов своих цифр. Пример такого числа: 4! + 0! + 5! + 8! + 5! = 40585 В качестве ответа на вопрос пришлите ссылку на http://jsfiddle.net/ с вашим кодом или на ваш репозиторий на https://github.com/." },
    { "id": "spaceships", "number": 14, "text": "Вы — пилот грузового межгалактического корабля. Ваша работа — перевозка грузов с одной планету на другую. Грузоподъемность вашего корабля ограничена, поэтому за один рейс вы можете перевезти не более N кг полезного груза. Ваш корабль умеет сообщать свое состояние (местоположение и степень загруженности), а также летать в любую точку пространства. Каждая планета может содержать на себе груз, который можно взять. Также на каждой планете груз можно оставить . Задание Даны незавершенные интерфейсы корабля и планеты. Напишите недостающий код. Полное условие задачи доступно на https://github.com/yandex-shri/introtask-space. В качестве ответа на вопрос пришлите ссылку на http://jsfiddle.net/ с вашим кодом или на ваш репозиторий на https://github.com/." },
    { "id": "css-task", "number": 15, "text": "Сверстайте форму-анкету с нашими заданиями для кандидатов. Страница должна работать в следующих браузерах: MSIE (8, 9, 10), Google Chrome (26, 27), Firefox (20, 21), Opera (12.15, 12.14), Яндекс.Браузер 1.5. По возможности используйте приёмы безопасной деградации CSS. Страница должна содержать интерактив, реализованный с помощью JS и jQuery. Это может быть: проверка полноты и правильности заполнения полей (где это возможно); возможность свернуть и развернуть разделы (аккордеон); индикатор заполнения анкеты; что-нибудь ещё. Подумайте над тем, как эти данные будут отправляться на сервер. Будет плюсом, если вы сверстаете страницу, используя БЭМ. Дополнительные задания 1. Выполните задание про форму-анкету, используя один из классических шаблонизаторов: Handlebars, mustache, Dust, Jade и т.п. 2. Выполните задание про форму-анкету, используя один из экзотических шаблонизаторов: XSLT, YATE, BEMHTML и т.п. Разработку необходимо вести на https://github.com/. В качестве ответа на вопрос пришлите ссылку на проект." }
  ]
}